Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E33A.tmx
Source language: en_us
Languages: zh_cn

source: How to Shoot A Family Portrait
zh_cn: 如何拍摄全家福

source: Was it an easy sell? Convincing the family to do these creative shots?
zh_cn: 劝说一家人去拍这些有创意的照片是一件简单的事情吗？

source: Yes, I have to say that my family is quite spontaneous.
zh_cn: 是的，我得说我的家人非常自发主动。

source: My parents have a great sense of humour so although there was a little hesitation initially with where it's going to be shot and what everyone has to do, the whole family took to the idea of a family portrait quite willingly.
zh_cn: 我的父母极富幽默感，因此即便最初对于在哪儿拍照和每个人应该做什么而有点犹豫，全家人还是十分乐意接受拍摄全家福这个想法的。

source: What were their reactions to the idea?
zh_cn: 他们对这个想法有何反应？

source: Well it started with my dad suddenly wanting a family portrait, I think he saw one in his friend's house and decided that it was something we needed to do.
zh_cn: 一开始是我的爸爸突然想要拍一张全家福，我猜他是在朋友家里看到了别人的全家福，决定我们也需要去拍一张。这是家族里程碑之一......

source: One of those family milestones­ But knowing what we are like, it was very hard to imagine us standing in front of a fake bookshelf with a globe in a corner looking prim and proper.
zh_cn: 但是我们都了解自己是什么样子，所以很难想象我们站在假的书架前，书架的角落上放一个地球仪，看起来一本正经的。

source: That would have been hilarious actually, it is so not who we are.
zh_cn: 那样看起来真的很滑稽可笑，这样拍出来的就不是我们了。

source: So I decided to come up with a concept that would best profile each individual family member but at the same time involve the entire family.
zh_cn: 因此我决定想出一个办法，既可以最好地刻画每一位家庭成员同时又能囊括全家的创意。

source: once they saw the initial sketches they were game for it.
zh_cn: 当他们看到了我最初的草图时，他们都很愿意尝试。

source: I heard you used a tripod to set it up- how does that work?
zh_cn: 我听说你用了三脚架把相机固定住，这是怎么做的？

source: It looks so professional!
zh_cn: 这看起来太专业了！

source: It's very rudimentary actually, more so because we didn't have a big set-up and also because it was more about the concept as opposed to doing a super sophisticated fashion spread-style shoot.
zh_cn: 这实际上是很简单的，尤其是因为我们并没有很大的装备，而且我们更注重的是拍照创意，而非进行超级精细的时尚拍摄。

source: Basically we thought about what we wanted and then looked at what we had and put the two together.
zh_cn: 从根本上说，我们想到我们想要的东西，然后看看我们所拥有的东西，然后把二者结合在一起。

source: It was a mix of necessity and invention!
zh_cn: 这是我们需要和创造的结合！

source: We also prayed very very hard.
zh_cn: 我们也非常努力地祈求能拍得成功。

source: In terms of costume design, did the Cai family specially go shopping for their various outfits?
zh_cn: 说到服装设计，凯一家人特意去购物来准备他们各式各样的行头吗？

source: It helps we have a huge box of 'costumes' or clothes left over from doing other commercial projects as my other sister is a freelance stylist.
zh_cn: 由于我的另一个姐姐是自由设计师，因此我们就有一大箱在其他商业活动中剩下来的服装，这对我们大有帮助。

source: The rest of the items are begged, borrowed and generously donated by friends and extended family.
zh_cn: 其他的衣服是朋友和亲戚借给我们或者慷慨捐助的。

source: We've been really fortunate to have the support of friends and relatives who hear about what we are doing, shake their heads in disbelief but still go out of their way to look for random objects that we can use for the shoot.
zh_cn: 有这些朋友和亲戚的帮助真的非常幸运，他们听说我们正在做的事情时，尽管摇头表示怀疑，但是仍然竭力寻找我们拍照或许能用的物品。

source: I try and angle the clothes around what we already wear or have but just more exaggerated in terms of colour and pattern, it is still about us after all (except maybe for the superhero outfits­ lol) .
zh_cn: 我尽量改变我们已经穿着或者有的服装，但是只是在颜色和式样上更夸张了些，毕竟穿上那些衣服我们还是保持了本色（或许除了超级英雄的装扮......）

source: What were the steps taken to make the shoot happen.
zh_cn: 拍照都采用了哪些步骤？

source: Idea.
zh_cn: 创意。

source: Sketch.
zh_cn: 草图。

source: Recce.
zh_cn: 侦察。

source: Test.
zh_cn: 试验。

source: Back to the drawing board.
zh_cn: 重来一次。

source: Add colour.
zh_cn: 添加色彩。

source: Hunt for costumes and props.
zh_cn: 寻找服装和道具。

source: Coordinate everyone's conflicting schedules.
zh_cn: 调整每个人与拍摄相冲突的安排。

source: Herd the family together for a trial before heading out for the shoot.
zh_cn: 在拍摄之前把一家人聚在一起试验一下。

source: Check equipment.
zh_cn: 检查设备。

source: Then pray very hard that everything goes well.
zh_cn: 然后非常虔诚地祈祷一切顺利。

source: How does one try to replicate what you did?
zh_cn: 他人如何仿照你们的步骤去做呢？

source: Just make sure you make it a fun exercise and remember that the ultimate goal is that it is a family portrait, its about the family and everyone has a part to play.
zh_cn: 要确信你把此事当成一种乐趣，记住你的最终目的是拍摄全家福，家里的每个人都要参与其中。

source: It needs to be something close to your heart if you want to make it a success.
zh_cn: 如果你想要拍得成功，就需要用心去做。

source: It takes a lot of energy and patience when you are dealing with family members and good communication is essential.
zh_cn: 在应付家庭成员时会花费很多精力和耐心，良好的沟通是至关重要的。

source: When you are standing under the hot sun swathed in lycra with a power-ranger mask obscuring your vision and the neighbours staring you have to believe in what you are doing or it's all going to seem like a bad idea.
zh_cn: 你身穿人造纤维的衣服站在炽热的太阳下用一个战队系列的面具遮住你的视线，你的邻居目不转睛地看着你，不得不相信你正在做的事情，或者这看似来似乎是个不怎么样的主意。

source: Thankfully everyone had lots of fun and we look back now at the out-takes and have a good laugh.
zh_cn: 谢天谢地，每个人都玩得非常开心，现在我们回顾之前拍摄的花絮都笑得很开心。

source: How do you deal with family members who aren't too sold of the idea? What's the big plus point to doing this?
zh_cn: 你是怎么应付不那么赞成这个主意的家庭成员的？做这件事的重要一点是什么？

source: I have no choice but to bribe them with chocolate.
zh_cn: 我只能用巧克力来贿赂他们了。

source: It's easier for everyone.
zh_cn: 这对每个人来说都更容易些。

source: Hahah well i think that if you explain the idea carefully and take time to make sure everyone knows that this is a team effort generally you won't have too many problems.
zh_cn: 哈哈，我认为如果你仔细地将这个想法解释一下，花时间让大家都知道这是一种团队合作，通常你就不会有太多的问题要处理了。

source: 5 tips to Great Family Portraits
zh_cn: 拍摄精品全家福的五个小贴士：

source: Spontaneity and willingness of the subjects (i.e. family members).
zh_cn: 家庭成员自发主动。

source: Chocolates for the unwilling.
zh_cn: 对于不情愿的成员用巧克力搞定。

source: Sketch the idea before hand (use magazine shoot ideas if you have to), do thumbnails.
zh_cn: 预先将创意用草图展现出来（如有必要使用杂志照片），画出缩略图。

source: Think beyond immediate family members in terms of costumes.
zh_cn: 在服装上要超出家庭成员的想象。

source: Everyone is a resource, everything can be used as a prop.
zh_cn: 每个人都足智多谋，任何事物都可拿来做道具。

source: Camera, tripod and willingness to experiment with a wide variety of poses and locations.
zh_cn: 备好相机和三脚架，愿意尝试各种各样的拍照姿势和地点。

source: Patience and passion to see the project through.
zh_cn: 全程具有耐心和充满激情。
